import type { Movie } from '../types/movie'

export const movies: Movie[] = [
  {
    id: 'm1',
    title: 'Интерстеллар',
    description:
      'Фантастический фильм о группе исследователей, отправившихся через космический портал на поиски нового дома для человечества.',
    type: 'movie',
    genre: 'Фантастика',
    year: 2014,
    rating: 8.7,
    country: 'США',
  },
  {
    id: 'm2',
    title: 'Начало',
    description:
      'История специалиста, который умеет проникать в сны людей и извлекать из них информацию.',
    type: 'movie',
    genre: 'Фантастика',
    year: 2010,
    rating: 8.8,
    country: 'США',
  },
  {
    id: 'm3',
    title: 'Очень странные дела',
    description:
      'Сериал о подростках, которые сталкиваются с необычными событиями и тайнами небольшого города.',
    type: 'series',
    genre: 'Фантастика',
    year: 2016,
    rating: 8.6,
    country: 'США',
  },
  {
    id: 'm4',
    title: 'Шерлок',
    description:
      'Сериал о современном Шерлоке Холмсе и его расследованиях сложных преступлений.',
    type: 'series',
    genre: 'Детектив',
    year: 2010,
    rating: 9.1,
    country: 'Великобритания',
  },
  {
    id: 'm5',
    title: 'Побег из Шоушенка',
    description:
      'Драма о дружбе, надежде и стремлении к свободе человека, оказавшегося в тюрьме.',
    type: 'movie',
    genre: 'Драма',
    year: 1994,
    rating: 9.3,
    country: 'США',
  },
]